---
kind: other
id: Properties.T:Autodesk.Revit.DB.Lighting.LightFamily
source: html/1598d66a-ba56-5aac-44ce-42120dd0001c.htm
---
# LightFamily Properties

Specifies whether the .NET object represents a valid Revit entity.